In [1]:
import pandas as pd

In [8]:
s = pd.Series([1,2,3],dtype=float,index=['i','t','a'])

In [9]:
s

i    1.0
t    2.0
a    3.0
dtype: float64

In [12]:
sec1 = pd.Series(['archi1','anal1','elec','alg1'])
sec2 = pd.Series(['elecfond','anal2','meca','alg2'])

In [16]:
cp1 = pd.concat([sec1,sec2],ignore_index=True)

In [17]:
cp1

0      archi1
1       anal1
2        elec
3        alg1
4    elecfond
5       anal2
6        meca
7        alg2
dtype: object

In [20]:
cp1.drop(0,inplace=True)

In [21]:
cp1

1       anal1
2        elec
3        alg1
4    elecfond
5       anal2
6        meca
7        alg2
dtype: object

In [25]:
s = pd.Series([1,2,3,4,5])
c = pd.Series([11,12,13,14,15])

In [28]:
s.div(c)

0    0.090909
1    0.166667
2    0.230769
3    0.285714
4    0.333333
dtype: float64

In [32]:
data = {
    'names':['tayeb','abderahim','ismail'],
    'avrgs':[15.66,15.62,15.58],
    'grps':[10,10,3]
}

In [33]:
d = pd.DataFrame(data)

In [34]:
d

       names  avrgs  grps
0      tayeb  15.66    10
1  abderahim  15.62    10
2     ismail  15.58     3

In [101]:
file = pd.read_csv('file.csv')

In [48]:
file.sample()

   name  age      job
2  nada   17  painter

In [41]:
file

     name  age         job
0  Rahimo   18     web dev
1    Moha   19  bug bounty
2    nada   17     painter
3   Ahmed   15    desinger

In [43]:
print(file[['age']].groupby('age').mean())

Empty DataFrame
Columns: []
Index: [15, 17, 18, 19]

In [45]:
file.describe(include=[object])

          name      job
count        4        4
unique       4        4
top     Rahimo  web dev
freq         1        1

In [49]:
file['name']

0    Rahimo
1      Moha
2      nada
3     Ahmed
Name: name, dtype: object

In [51]:
file[1:3]

   name  age         job
1  Moha   19  bug bounty
2  nada   17     painter

In [54]:
file.loc[0:3,['name','age']]

     name  age
0  Rahimo   18
1    Moha   19
2    nada   17
3   Ahmed   15

In [55]:
file[file['age']>17]

     name  age         job
0  Rahimo   18     web dev
1    Moha   19  bug bounty

In [70]:
f = file[file['age'].isnull()==False]['age']

In [71]:
f

0    18
1    19
2    17
3    15
Name: age, dtype: int64

In [72]:
file

     name  age         job
0  Rahimo   18     web dev
1    Moha   19  bug bounty
2    nada   17     painter
3   Ahmed   15    desinger

In [74]:
def incage(age) :
    return age + 1

In [80]:
file.age = file['age'].apply(incage)

In [97]:
file.sort_values('age',ascending=False,inplace=True)
file

     name  age         job
1    Moha   20  bug bounty
0  Rahimo   19     web dev
2    nada   18     painter
3   Ahmed   16    desinger

In [98]:
file.sort_index(axis=0,ascending=True)

     name  age         job
0  Rahimo   19     web dev
1    Moha   20  bug bounty
2    nada   18     painter
3   Ahmed   16    desinger

In [103]:
file.job = 'es'

In [104]:
file

     name  age job
0  Rahimo   18  es
1    Moha   19  es
2    nada   17  es
3   Ahmed   15  es

In [112]:
file[['job','age']].groupby('job').count()

     age
job
es     4